package tasks

import (
	"fmt"
	"math"
)

/*
Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
Объединить данные значения в группы с шагом в 10 градусов. Последовательность в подмножноствах не важна.

Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.
*/

func Task10() {

	// Создаем слайс температурных показателей
	tempArray := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}

	// Создаем хэш-таблицу, где значениями будут слайсы с температурами,
	//а ключами - наименование группы температур
	tempMap := make(map[float64][]float64)

	for _, temp := range tempArray {
		/*
			Задача решается одним циклом. Проходим по каждому элементу слайса,
			Создаем ключ из каждого температурного слайса на каждой итерации.
			Затем записываем в нашу хэш-таблицу, полученный из температурного значения, ключ
			и по нему добавляем значение в слайс.
			Далее значения просто записываются в слайс по существующему ключу, если он уже есть.
		*/
		// При создании ключа температура делится на 10, округляется в меньшую сторону и умножается на 10
		key := math.Trunc(temp/10.0) * 10.0
		tempMap[key] = append(tempMap[key], temp)
	}

	// Выводим хэш-таблицу в stdout
	for key, value := range tempMap {
		fmt.Println(key, value)
	}

}
